Games/Fallout1.Steam/MUTANT3.ssl.diff
diff --git a/Games/Fallout1.Steam/Original/MUTANT3.ssl b/Games/Fallout1.Steam/ReDefine/MUTANT3.ssl
index aeaac82..c1b6ced 100644
--- a/Games/Fallout1.Steam/Original/MUTANT3.ssl
+++ b/Games/Fallout1.Steam/ReDefine/MUTANT3.ssl
@@ -11,25 +11,25 @@ variable couple_of_minutes;
 procedure start
 begin
     if (not(init_teams)) then begin
-        critter_add_trait(self_obj, 1, 6, 34);
+        critter_add_trait(self_obj, TRAIT_OBJECT, OBJECT_TEAM_NUM, 34);
         init_teams := 1;
     end
     else begin
-        if (script_action == 22) then begin
+        if (script_action == timed_event_proc) then begin
             call timeforwhat();
         end
         else begin
-            if (script_action == 4) then begin
+            if (script_action == pickup_proc) then begin
                 Hostile := 1;
             end
             else begin
-                if (script_action == 12) then begin
+                if (script_action == critter_proc) then begin
                     if (Hostile) then begin
                         Hostile := 0;
-                        attack_complex(dude_obj, 0, 1, 0, 0, 30000, 0, 0);
+                        attack(dude_obj);
                     end
                     else begin
-                        if (global_var(13) == 0) then begin
+                        if (global_var(GVAR_NECROPOLIS_INVADED) == 0) then begin
                             set_obj_visibility(self_obj, 1);
                         end
                         else begin
@@ -41,26 +41,26 @@ begin
                     end
                 end
                 else begin
-                    if (script_action == 18) then begin
-                        set_global_var(35, global_var(35) + 1);
+                    if (script_action == destroy_proc) then begin
+                        set_global_var(GVAR_SUPER_MUTANTS_KILLED, global_var(GVAR_SUPER_MUTANTS_KILLED) + 1);
                         if (source_obj == dude_obj) then begin
-                            if (((global_var(160) + global_var(159)) >= 25) and ((global_var(159) > (2 * global_var(160))) or (global_var(156) == 1))) then begin
-                                set_global_var(156, 1);
-                                set_global_var(157, 0);
+                            if (((global_var(GVAR_BAD_MONSTER) + global_var(GVAR_GOOD_MONSTER)) >= 25) and ((global_var(GVAR_GOOD_MONSTER) > (2 * global_var(GVAR_BAD_MONSTER))) or (global_var(GVAR_BERSERKER_REPUTATION) == 1))) then begin
+                                set_global_var(GVAR_BERSERKER_REPUTATION, 1);
+                                set_global_var(GVAR_CHAMPION_REPUTATION, 0);
                             end
-                            if (((global_var(160) + global_var(159)) >= 25) and ((global_var(160) > (3 * global_var(159))) or (global_var(157) == 1))) then begin
-                                set_global_var(157, 1);
-                                set_global_var(156, 0);
+                            if (((global_var(GVAR_BAD_MONSTER) + global_var(GVAR_GOOD_MONSTER)) >= 25) and ((global_var(160) > (3 * global_var(GVAR_GOOD_MONSTER))) or (global_var(GVAR_CHAMPION_REPUTATION) == 1))) then begin
+                                set_global_var(GVAR_CHAMPION_REPUTATION, 1);
+                                set_global_var(GVAR_BERSERKER_REPUTATION, 0);
                             end
-                            set_global_var(160, global_var(160) + 1);
-                            if ((global_var(160) % 6) == 0) then begin
-                                set_global_var(155, global_var(155) + 1);
+                            set_global_var(GVAR_BAD_MONSTER, global_var(GVAR_BAD_MONSTER) + 1);
+                            if ((global_var(GVAR_BAD_MONSTER) % 6) == 0) then begin
+                                set_global_var(GVAR_PLAYER_REPUATION, global_var(GVAR_PLAYER_REPUATION) + 1);
                             end
                         end
                     end
                     else begin
-                        if (script_action == 21) then begin
-                            display_msg(message_str(232, 100));
+                        if (script_action == look_at_proc) then begin
+                            display_mstr(100);
                         end
                     end
                 end
@@ -91,4 +91,3 @@ procedure superx
 begin
     call supercbt();
 end
-
