Mods/MutantsRising.demo/ELKOI1.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI1.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI1.ssl
index 07328e9..b9617b7 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI1.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI1.ssl
@@ -139,28 +139,27 @@ end
 procedure description_p_proc
 begin
     script_overrides;
-    if (global_var(696) < 11) then begin
-        display_msg(message_str(1324, 101));
+    if (global_var(GVAR_ELKO_SICK_JONAS_QUEST) < 11) then begin
+        display_msg(mstr(101));
     end
     else begin
-        display_msg(message_str(1324, 102));
+        display_msg(mstr(102));
     end
 end
 
 procedure look_at_p_proc
 begin
     script_overrides;
-    display_msg(message_str(1324, 100));
+    display_msg(mstr(100));
 end
 
 procedure use_p_proc
 begin
     script_overrides;
-    if (global_var(696) < 11) then begin
-        display_msg(message_str(1324, 101));
+    if (global_var(GVAR_ELKO_SICK_JONAS_QUEST) < 11) then begin
+        display_msg(mstr(101));
     end
     else begin
-        display_msg(message_str(1324, 102));
+        display_msg(mstr(102));
     end
 end
-
