Mods/MutantsRising.demo/ELKOI10.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI10.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI10.ssl
index 460d249..18f7ef3 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI10.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI10.ssl
@@ -186,21 +186,21 @@ begin
     if (skill == 9) then begin
         script_overrides;
         if (local_var(1) == 0) then begin
-            display_msg(message_str(1360, 103));
+            display_msg(mstr(103));
         end
         else begin
             if (is_success(roll_vs_skill(dude_obj, 9, 0))) then begin
-                display_msg(message_str(1360, 101));
+                display_msg(mstr(101));
                 if (local_var(2) == 0) then begin
                     set_local_var(2, 1);
                     give_exp_points(25);
-                    display_msg(message_str(14, 100) + 25 + message_str(14, 101));
+                    display_msg(g_mstr(100) + 25 + g_mstr(101));
                 end
                 obj_unlock(self_obj);
                 set_local_var(1, 0);
             end
             else begin
-                display_msg(message_str(1360, 102));
+                display_msg(mstr(102));
             end
         end
     end
@@ -211,8 +211,7 @@ begin
     if (source_obj == dude_obj) then begin
         if (local_var(1) == 1) then begin
             script_overrides;
-            display_msg(message_str(1360, 100));
+            display_msg(mstr(100));
         end
     end
 end
-
