Mods/MutantsRising.demo/ELKOI11.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI11.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI11.ssl
index 5c920e2..8014f0f 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI11.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI11.ssl
@@ -138,10 +138,10 @@ end
 
 procedure use_p_proc
 begin
-    if ((global_var(701) >= 3) and (source_obj == dude_obj)) then begin
+    if ((global_var(GVAR_ELKO_BIG_TROUBLE) >= 3) and (source_obj == dude_obj)) then begin
         if (elevation(self_obj) == 0) then begin
             if (elevation(cassidy_ptr) == 0) then begin
-                display_msg(message_str(1373, 100));
+                display_msg(mstr(100));
                 move_to(cassidy_ptr, 16694, 1);
                 anim(cassidy_ptr, 1000, 4);
             end
@@ -155,4 +155,3 @@ begin
         end
     end
 end
-
