Mods/MutantsRising.demo/ELKOI12.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI12.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI12.ssl
index 4949148..31c2208 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI12.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI12.ssl
@@ -142,30 +142,29 @@ begin
         if (local_var(1) == 0) then begin
             set_local_var(1, 1);
             item_caps_adjust(self_obj, 65);
-            item := create_object_sid(45, 0, 0, -1);
+            item := create_object(45, 0, 0);
             add_obj_to_inven(self_obj, item);
-            item := create_object_sid(273, 0, 0, -1);
+            item := create_object(273, 0, 0);
             add_obj_to_inven(self_obj, item);
-            if (get_critter_stat(dude_obj, 4) > 3) then begin
-                if (get_critter_stat(dude_obj, 34) == 0) then begin
-                    item := create_object_sid(225, 0, 0, -1);
+            if (dude_iq > 3) then begin
+                if (dude_gender == 0) then begin
+                    item := create_object(225, 0, 0);
                     add_obj_to_inven(self_obj, item);
                 end
                 else begin
-                    item := create_object_sid(278, 0, 0, -1);
+                    item := create_object(278, 0, 0);
                     add_obj_to_inven(self_obj, item);
                 end
             end
             else begin
-                item := create_object_sid(491, 0, 0, -1);
+                item := create_object(491, 0, 0);
                 add_obj_to_inven(self_obj, item);
             end
         end
     end
     else begin
-        if ((get_critter_stat(dude_obj, 34) == 1) or (get_critter_stat(dude_obj, 4) < 4)) then begin
+        if ((dude_gender == 1) or (dude_iq < 4)) then begin
             destroy_object(self_obj);
         end
     end
 end
-
