Mods/MutantsRising.demo/ELKOI13.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI13.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI13.ssl
index 33fab21..8024ded 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI13.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI13.ssl
@@ -150,11 +150,11 @@ begin
     if (skill == 9) then begin
         script_overrides;
         if (elevation(self_obj) == 0) then begin
-            display_msg(message_str(1540, 106));
+            display_msg(mstr(106));
         end
         else begin
             if (elevation(self_obj) == 1) then begin
-                display_msg(message_str(1540, 107));
+                display_msg(mstr(107));
             end
         end
     end
@@ -163,16 +163,16 @@ end
 procedure use_obj_on_p_proc
 begin
     tool := obj_pid(obj_being_used_with);
-    if (get_critter_stat(dude_obj, 4) < 4) then begin
+    if (dude_iq < 4) then begin
         script_overrides;
         if (tool == 532) then begin
             if (elevation(self_obj) == 0) then begin
-                display_msg(message_str(1540, 104));
+                display_msg(mstr(104));
             end
             else begin
                 if (elevation(self_obj) == 1) then begin
                     set_local_var(1, 1);
-                    display_msg(message_str(1540, 105));
+                    display_msg(mstr(105));
                 end
             end
         end
@@ -180,23 +180,23 @@ begin
             if (tool == 548) then begin
                 if (elevation(self_obj) == 0) then begin
                     set_local_var(1, 1);
-                    display_msg(message_str(1540, 101));
+                    display_msg(mstr(101));
                 end
                 else begin
                     if (elevation(self_obj) == 1) then begin
-                        display_msg(message_str(1540, 108));
+                        display_msg(mstr(108));
                     end
                 end
             end
             else begin
                 if (tool == 549) then begin
                     if (elevation(self_obj) == 0) then begin
-                        display_msg(message_str(1540, 108));
+                        display_msg(mstr(108));
                     end
                     else begin
                         if (elevation(self_obj) == 1) then begin
                             set_local_var(1, 1);
-                            display_msg(message_str(1540, 103));
+                            display_msg(mstr(103));
                         end
                     end
                 end
@@ -210,12 +210,12 @@ begin
     if (elevation(self_obj) == 0) then begin
         if ((obj_is_carrying_obj_pid(dude_obj, 548) == 0) and (local_var(1) == 0)) then begin
             script_overrides;
-            display_msg(message_str(1540, 100));
+            display_msg(mstr(100));
         end
         else begin
             if ((obj_is_carrying_obj_pid(dude_obj, 548) > 0) and (local_var(1) == 0)) then begin
                 set_local_var(1, 1);
-                display_msg(message_str(1540, 101));
+                display_msg(mstr(101));
             end
         end
     end
@@ -223,15 +223,14 @@ begin
         if (elevation(self_obj) == 1) then begin
             if ((obj_is_carrying_obj_pid(dude_obj, 549) == 0) and (local_var(1) == 0)) then begin
                 script_overrides;
-                display_msg(message_str(1540, 102));
+                display_msg(mstr(102));
             end
             else begin
                 if ((obj_is_carrying_obj_pid(dude_obj, 549) > 0) and (local_var(1) == 0)) then begin
                     set_local_var(1, 1);
-                    display_msg(message_str(1540, 103));
+                    display_msg(mstr(103));
                 end
             end
         end
     end
 end
-
