Mods/MutantsRising.demo/ELKOI15.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI15.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI15.ssl
index df1b096..9fece49 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI15.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI15.ssl
@@ -150,12 +150,12 @@ procedure description_p_proc
 begin
     if (obj_pid(self_obj) == 33555377) then begin
         script_overrides;
-        display_msg(message_str(1544, 103));
+        display_msg(mstr(103));
     end
     else begin
         if (obj_pid(self_obj) == 33557172) then begin
             script_overrides;
-            display_msg(message_str(1544, 102));
+            display_msg(mstr(102));
         end
     end
 end
@@ -166,7 +166,7 @@ begin
     if (tool == 127) then begin
         if (obj_pid(self_obj) == 33555377) then begin
             script_overrides;
-            gfade_out(1);
+            fade_out;
             removed_qty := obj_is_carrying_obj_pid(dude_obj, 127);
             if (1 < removed_qty) then begin
                 removed_qty := 1;
@@ -185,7 +185,7 @@ begin
                     end
                     else begin
                         if ((critter_inven_obj(dude_obj, 2) == restock_obj) or (critter_inven_obj(dude_obj, 1) == restock_obj)) then begin
-                            metarule(43, dude_obj);
+                            inven_unwield(dude_obj);
                         end
                     end
                 end
@@ -194,16 +194,16 @@ begin
             end
             restock_obj := 0;
             restock_amt := 0;
-            create_object_sid(33557172, tile_num(self_obj), 0, 1544);
-            create_object_sid(33557173, 31300, 0, 1544);
-            display_msg(message_str(1544, 100));
-            gfade_in(1);
+            create_object_sid(33557172, tile_num(self_obj), 0, NAME);
+            create_object_sid(33557173, 31300, 0, NAME);
+            display_msg(mstr(100));
+            fade_in;
             destroy_object(self_obj);
         end
         else begin
             if (obj_pid(self_obj) == 33557172) then begin
                 script_overrides;
-                display_msg(message_str(1544, 101));
+                display_msg(mstr(101));
             end
         end
     end
@@ -212,18 +212,17 @@ end
 procedure use_p_proc
 begin
     if (obj_pid(self_obj) == 33557172) then begin
-        gfade_out(1);
-        display_msg(message_str(1544, 104));
+        fade_out;
+        display_msg(mstr(104));
         move_to(dude_obj, tile_num_in_direction(31300, 1, 1), 0);
-        gfade_in(1);
+        fade_in;
     end
     else begin
         if (obj_pid(self_obj) == 33557173) then begin
-            gfade_out(1);
-            display_msg(message_str(1544, 105));
+            fade_out;
+            display_msg(mstr(105));
             move_to(dude_obj, tile_num_in_direction(map_var(1), 5, 1), 0);
-            gfade_in(1);
+            fade_in;
         end
     end
 end
-
