Mods/MutantsRising.demo/ELKOI4.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI4.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI4.ssl
index 6eb71a9..47cd13c 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI4.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI4.ssl
@@ -182,7 +182,7 @@ begin
         end
     end
     else begin
-        display_msg(message_str(1327, 100));
+        display_mstr(100);
     end
 end
 
@@ -192,11 +192,10 @@ begin
         set_map_var(18, 1);
         set_map_var(19, game_time + (10 * (60 * 10)));
     end
-    display_msg(message_str(1327, 101));
+    display_mstr(101);
     give_exp_points(10);
-    display_msg(message_str(14, 100) + 10 + message_str(14, 101));
+    display_msg(g_mstr(100) + 10 + g_mstr(101));
     add_timer_event(self_obj, 1, 0);
-    item := create_object_sid(533, 0, 0, -1);
+    item := create_object(533, 0, 0);
     add_obj_to_inven(dude_obj, item);
 end
-
