Mods/MutantsRising.demo/ELKOI7.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI7.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI7.ssl
index 2d520e2..355dcd0 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI7.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI7.ssl
@@ -144,7 +144,7 @@ procedure map_update_p_proc
 begin
     if (map_var(4) > 0) then begin
         if (tile_num(self_obj) == 21286) then begin
-            create_object_sid(50331854, tile_num(self_obj), elevation(self_obj), -1);
+            create_object(50331854, tile_num(self_obj), elevation(self_obj));
             destroy_object(self_obj);
         end
         else begin
@@ -153,7 +153,7 @@ begin
             end
             else begin
                 if (tile_num(self_obj) == 21686) then begin
-                    create_object_sid(50331853, tile_num(self_obj), elevation(self_obj), -1);
+                    create_object(50331853, tile_num(self_obj), elevation(self_obj));
                     destroy_object(self_obj);
                 end
             end
@@ -168,16 +168,16 @@ end
 procedure use_obj_on_p_proc
 begin
     if (obj_pid(obj_being_used_with) == 532) then begin
-        if (global_var(695) >= 4) then begin
+        if (global_var(GVAR_ELKO_GOLD_DIGGER) >= 4) then begin
             script_overrides;
             if (party_member_obj(16777701) != 0) then begin
-                float_msg(cassidy_ptr, message_str(1335, random(103, 106)), 2);
+                float_msg(cassidy_ptr, mstr(random(103, 106)), FLOAT_MSG_RED);
             end
             else begin
-                gfade_out(1);
-                display_msg(message_str(1335, 107));
+                fade_out;
+                display_msg(mstr(107));
                 game_time_advance(8 * (60 * 10));
-                gfade_in(1);
+                fade_in;
                 set_map_var(4, 1);
                 game_time_advance(2 * (60 * 10));
             end
@@ -188,22 +188,21 @@ end
 procedure look_at_p_proc
 begin
     script_overrides;
-    if (global_var(695) != 4) then begin
-        display_msg(message_str(1335, 100));
+    if (global_var(GVAR_ELKO_GOLD_DIGGER) != 4) then begin
+        display_msg(mstr(100));
     end
     else begin
-        display_msg(message_str(1335, 101));
+        display_msg(mstr(101));
     end
 end
 
 procedure description_p_proc
 begin
-    if (global_var(695) == 4) then begin
+    if (global_var(GVAR_ELKO_GOLD_DIGGER) == 4) then begin
         script_overrides;
         if (party_member_obj(16777701) != 0) then begin
-            float_msg(cassidy_ptr, message_str(1335, random(103, 106)), 2);
+            float_msg(cassidy_ptr, mstr(random(103, 106)), FLOAT_MSG_RED);
         end
-        display_msg(message_str(1335, 102));
+        display_msg(mstr(102));
     end
 end
-
