Mods/MutantsRising.demo/ELKOI8.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI8.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI8.ssl
index 4f855fc..027690a 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI8.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI8.ssl
@@ -145,7 +145,7 @@ procedure use_skill_on_p_proc
 begin
     skill := action_being_used;
     if (skill == 10) then begin
-        if ((global_var(700) > 0) or (using_skill(dude_obj, 8) and is_success(roll_vs_skill(dude_obj, 8, -45)))) then begin
+        if ((global_var(GVAR_ELKO_MATATU_STATUS) > 0) or (using_skill(dude_obj, 8) and is_success(roll_vs_skill(dude_obj, 8, -45)))) then begin
         end
         else begin
             script_overrides;
@@ -157,7 +157,7 @@ end
 procedure description_p_proc
 begin
     if (elevation(self_obj) == 1) then begin
-        if ((tile_distance_objs(self_obj, dude_obj) < 4) and (global_var(701) >= 3)) then begin
+        if ((tile_distance_objs(self_obj, dude_obj) < 4) and (global_var(GVAR_ELKO_BIG_TROUBLE) >= 3)) then begin
             add_timer_event(cassidy_ptr, 2, 4);
         end
     end
@@ -166,13 +166,13 @@ end
 procedure use_p_proc
 begin
     if (elevation(self_obj) == 1) then begin
-        if ((source_obj == dude_obj) and (global_var(701) >= 3)) then begin
+        if ((source_obj == dude_obj) and (global_var(GVAR_ELKO_BIG_TROUBLE) >= 3)) then begin
             script_overrides;
             add_timer_event(cassidy_ptr, 4, 4);
         end
     end
     else begin
-        if ((global_var(700) > 0) or (using_skill(dude_obj, 8) and is_success(roll_vs_skill(dude_obj, 8, -45)))) then begin
+        if ((global_var(GVAR_ELKO_MATATU_STATUS) > 0) or (using_skill(dude_obj, 8) and is_success(roll_vs_skill(dude_obj, 8, -45)))) then begin
         end
         else begin
             script_overrides;
@@ -180,4 +180,3 @@ begin
         end
     end
 end
-
