Mods/MutantsRising.demo/ELKOI9.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOI9.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOI9.ssl
index 35cacb1..2eb1127 100644
--- a/Mods/MutantsRising.demo/Original/ELKOI9.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOI9.ssl
@@ -142,12 +142,12 @@ begin
     skill := action_being_used;
     if (skill == 9) then begin
         script_overrides;
-        if ((cur_map_index == 126) or (cur_map_index == 127)) then begin
-            display_msg(message_str(1353, 102));
+        if ((CUR_MAP_ARTEMPLE) or (CUR_MAP_ARDEAD)) then begin
+            display_mstr(102);
         end
         else begin
-            if (cur_map_index == 3) then begin
-                display_msg(message_str(1353, 104));
+            if (CUR_MAP_ARCAVES) then begin
+                display_mstr(104);
             end
         end
     end
@@ -155,26 +155,25 @@ end
 
 procedure use_p_proc
 begin
-    if ((cur_map_index == 126) or (cur_map_index == 127)) then begin
+    if ((CUR_MAP_ARTEMPLE) or (CUR_MAP_ARDEAD)) then begin
         script_overrides;
-        if (cur_map_index == 126) then begin
-            display_msg(message_str(1353, 100));
+        if (CUR_MAP_ARTEMPLE) then begin
+            display_mstr(100);
             if (map_var(2) == 0) then begin
                 set_map_var(2, 1);
-                float_msg(dude_obj, message_str(1353, 101), 0);
+                float_msg(dude_obj, mstr(101), FLOAT_MSG_NORMAL);
             end
         end
         else begin
-            display_msg(message_str(1353, 105));
+            display_mstr(105);
         end
     end
     else begin
-        if (cur_map_index == 3) then begin
-            if (global_var(701) < 3) then begin
+        if (CUR_MAP_ARCAVES) then begin
+            if (global_var(GVAR_ELKO_BIG_TROUBLE) < 3) then begin
                 script_overrides;
-                display_msg(message_str(1353, 103));
+                display_mstr(103);
             end
         end
     end
 end
-
