Mods/MutantsRising.demo/ELKOM1.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOM1.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOM1.ssl
index c4a5d01..2edc311 100644
--- a/Mods/MutantsRising.demo/Original/ELKOM1.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOM1.ssl
@@ -154,35 +154,35 @@ end
 
 procedure map_exit_p_proc
 begin
-    if ((global_var(884) > 0) and ((global_var(904) > 0) or (global_var(907) > 0))) then begin
-        if (global_var(906) > game_time) then begin
-            set_global_var(905, global_var(906));
+    if ((global_var(GVAR_HEALING_MOD) > 0) and ((global_var(GVAR_BLEEDING_WOUNDS) > 0) or (global_var(GVAR_PAUSED_WOUNDS) > 0))) then begin
+        if (global_var(GVAR_BLEEDING_PILLS_TIME) > game_time) then begin
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, global_var(GVAR_BLEEDING_PILLS_TIME));
         end
         else begin
-            set_global_var(905, game_time);
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, game_time);
         end
     end
 end
 
 procedure map_enter_p_proc
 begin
-    if ((global_var(700) == 1) and (global_var(698) == 10)) then begin
+    if ((global_var(GVAR_ELKO_MATATU_STATUS) == 1) and (global_var(GVAR_ELKO_ARROYAN_SICKNESS) == 10)) then begin
         override_map_start(tile_num_in_direction(25896, 3, 2) % 200, tile_num_in_direction(25896, 3, 2) / 200, 0, 0);
         game_ui_disable;
         councilor := tile_contains_pid_obj(25896, 0, 16777702);
         add_timer_event(councilor, 10, 1);
     end
     else begin
-        if ((global_var(700) == 1) and (global_var(710) == 6)) then begin
-            create_object_sid(16777700, 24067, 0, 1308);
+        if ((global_var(GVAR_ELKO_MATATU_STATUS) == 1) and (global_var(GVAR_ELKO_SHITSTORM) == 6)) then begin
+            create_object_sid(16777700, 24067, 0, SCRIPT_ELKOC4);
             junky := tile_contains_pid_obj(24067, 0, 16777700);
             anim(junky, 1000, 5);
             override_map_start(16922 % 200, 16922 / 200, 0, 5);
         end
         else begin
-            if (global_var(706) == 5) then begin
-                if (global_var(707) >= 3) then begin
-                    create_object_sid(16777283, 21932, 0, 1323);
+            if (global_var(GVAR_ELKO_ERRAND_DUDE) == 5) then begin
+                if (global_var(GVAR_ELKO_LOCKET_SUBQUEST) >= 3) then begin
+                    create_object_sid(16777283, 21932, 0, SCRIPT_ELKOC19);
                     badbro := tile_contains_pid_obj(21932, 0, 16777283);
                     anim(badbro, 1000, 3);
                 end
@@ -193,18 +193,18 @@ begin
             end
         end
     end
-    if (metarule(14, 0)) then begin
-        if (get_critter_stat(dude_obj, 33) < 18) then begin
-            add_dude_years := 18 - get_critter_stat(dude_obj, 33);
-            set_critter_stat(dude_obj, 33, add_dude_years);
+    if (map_first_run) then begin
+        if (dude_age < 18) then begin
+            add_dude_years := 18 - dude_age;
+            set_critter_stat(dude_obj, STAT_age, add_dude_years);
         end
         else begin
-            if (get_critter_stat(dude_obj, 33) > 18) then begin
-                add_dude_years := get_critter_stat(dude_obj, 33) - 18;
-                set_critter_stat(dude_obj, 33, -add_dude_years);
+            if (dude_age > 18) then begin
+                add_dude_years := dude_age - 18;
+                set_critter_stat(dude_obj, STAT_age, -add_dude_years);
             end
         end
-        display_msg(message_str(1305, 100));
+        display_mstr(100);
     end
     if (map_var(10) == 0) then begin
         set_map_var(10, 23474);
@@ -295,4 +295,3 @@ begin
         set_light_level(50);
     end
 end
-
