Mods/MutantsRising.demo/ELKOM2.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOM2.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOM2.ssl
index 2b9585d..b0ff1bc 100644
--- a/Mods/MutantsRising.demo/Original/ELKOM2.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOM2.ssl
@@ -152,38 +152,38 @@ end
 
 procedure map_exit_p_proc
 begin
-    if ((global_var(884) > 0) and ((global_var(904) > 0) or (global_var(907) > 0))) then begin
-        if (global_var(906) > game_time) then begin
-            set_global_var(905, global_var(906));
+    if ((global_var(GVAR_HEALING_MOD) > 0) and ((global_var(GVAR_BLEEDING_WOUNDS) > 0) or (global_var(GVAR_PAUSED_WOUNDS) > 0))) then begin
+        if (global_var(GVAR_BLEEDING_PILLS_TIME) > game_time) then begin
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, global_var(GVAR_BLEEDING_PILLS_TIME));
         end
         else begin
-            set_global_var(905, game_time);
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, game_time);
         end
     end
 end
 
 procedure map_enter_p_proc
 begin
-    if (metarule(14, 0)) then begin
-        display_msg(message_str(1346, 100));
+    if (map_first_run) then begin
+        display_msg(mstr(100));
     end
     anim(dude_obj, 1000, 1);
-    if (global_var(703) == 3) then begin
+    if (global_var(GVAR_ELKO_PACK_OF_DOGS) == 3) then begin
         game_ui_disable;
         override_map_start(17475 % 200, 17475 / 200, 0, 5);
         if (tile_contains_obj_pid(16472, 0, 16777711) == 0) then begin
-            create_object_sid(16777711, 16472, 0, 1315);
+            create_object_sid(16777711, 16472, 0, SCRIPT_ELKOC11);
         end
         llynch := tile_contains_pid_obj(16472, 0, 16777711);
         if (tile_contains_obj_pid(15672, 0, 16777725) == 0) then begin
-            create_object_sid(16777725, 15672, 0, 1319);
+            create_object_sid(16777725, 15672, 0, SCRIPT_ELKOC15);
         end
         rrussel := tile_contains_pid_obj(15672, 0, 16777725);
-        rot := rotation_to_tile(tile_num(llynch), tile_num(dude_obj));
+        rot := rotation_to_tile(tile_num(llynch), dude_tile);
         anim(llynch, 1000, rot);
-        rot := rotation_to_tile(tile_num(rrussel), tile_num(dude_obj));
+        rot := rotation_to_tile(tile_num(rrussel), dude_tile);
         anim(rrussel, 1000, rot);
-        float_msg(llynch, message_str(1346, 120), 3);
+        float_msg(llynch, mstr(120), FLOAT_MSG_GREEN);
         set_map_var(1, 1);
         add_timer_event(llynch, 10, 1);
         add_timer_event(rrussel, 14, 0);
@@ -269,4 +269,3 @@ begin
         end
     end
 end
-
