Mods/MutantsRising.demo/ELKOM3.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOM3.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOM3.ssl
index 6305179..a6bd913 100644
--- a/Mods/MutantsRising.demo/Original/ELKOM3.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOM3.ssl
@@ -155,32 +155,32 @@ end
 
 procedure map_exit_p_proc
 begin
-    if ((global_var(884) > 0) and ((global_var(904) > 0) or (global_var(907) > 0))) then begin
-        if (global_var(906) > game_time) then begin
-            set_global_var(905, global_var(906));
+    if ((global_var(GVAR_HEALING_MOD) > 0) and ((global_var(GVAR_BLEEDING_WOUNDS) > 0) or (global_var(GVAR_PAUSED_WOUNDS) > 0))) then begin
+        if (global_var(GVAR_BLEEDING_PILLS_TIME) > game_time) then begin
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, global_var(GVAR_BLEEDING_PILLS_TIME));
         end
         else begin
-            set_global_var(905, game_time);
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, game_time);
         end
     end
 end
 
 procedure map_enter_p_proc
 begin
-    if (global_var(706) == 4) then begin
+    if (global_var(GVAR_ELKO_ERRAND_DUDE) == 4) then begin
         if (tile_contains_obj_pid(16872, 0, 16777725) == 0) then begin
-            create_object_sid(16777725, 16872, 0, 1319);
+            create_object_sid(16777725, 16872, 0, SCRIPT_ELKOC15);
         end
         override_map_start(17075 % 200, 17075 / 200, 0, 0);
         russell := tile_contains_pid_obj(16872, 0, 16777725);
         anim(russell, 1000, 3);
     end
     else begin
-        if (global_var(710) == 2) then begin
-            if (metarule(22, 0) == 0) then begin
+        if (global_var(GVAR_ELKO_SHITSTORM) == 2) then begin
+            if (is_loading_game == 0) then begin
                 set_map_var(6, 1);
                 if (tile_contains_obj_pid(13320, 0, 16777701) == 0) then begin
-                    create_object_sid(16777701, 13320, 0, 1304);
+                    create_object_sid(16777701, 13320, 0, SCRIPT_ELKOC1);
                 end
                 override_map_start(13719 % 200, 13719 / 200, 0, 5);
                 cass := tile_contains_pid_obj(13320, 0, 16777701);
@@ -191,9 +191,9 @@ begin
             end
         end
         else begin
-            if (global_var(701) == 3) then begin
+            if (global_var(GVAR_ELKO_BIG_TROUBLE) == 3) then begin
                 if (tile_contains_obj_pid(16696, 0, 16777701) == 0) then begin
-                    create_object_sid(16777701, 16696, 0, 1304);
+                    create_object_sid(16777701, 16696, 0, SCRIPT_ELKOC1);
                 end
                 override_map_start(17099 % 200, 17099 / 200, 0, 0);
                 cass := tile_contains_pid_obj(16696, 0, 16777701);
@@ -201,20 +201,20 @@ begin
                 add_timer_event(cass, 12, 2);
             end
             else begin
-                if (global_var(698) == 8) then begin
+                if (global_var(GVAR_ELKO_ARROYAN_SICKNESS) == 8) then begin
                     set_map_var(1, 1);
                     if (tile_contains_obj_pid(24528, 0, 16777702) == 0) then begin
-                        create_object_sid(16777702, 24528, 0, 1307);
+                        create_object_sid(16777702, 24528, 0, SCRIPT_ELKOC3);
                     end
                     if (tile_contains_obj_pid(24326, 0, 16777711) == 0) then begin
-                        create_object_sid(16777711, 24326, 0, 1315);
+                        create_object_sid(16777711, 24326, 0, SCRIPT_ELKOC11);
                     end
-                    if (get_critter_stat(dude_obj, 4) < 4) then begin
+                    if (dude_iq < 4) then begin
                         if (tile_contains_obj_pid(24925, 0, 16777700) == 0) then begin
-                            create_object_sid(16777700, 24925, 0, 1308);
+                            create_object_sid(16777700, 24925, 0, SCRIPT_ELKOC4);
                         end
                         if (tile_contains_obj_pid(25127, 0, 16777701) == 0) then begin
-                            create_object_sid(16777701, 25127, 0, 1304);
+                            create_object_sid(16777701, 25127, 0, SCRIPT_ELKOC1);
                         end
                         cass := tile_contains_pid_obj(25127, 0, 16777701);
                         junky := tile_contains_pid_obj(24925, 0, 16777700);
@@ -233,8 +233,8 @@ begin
                 end
                 else begin
                     override_map_start(28080 % 200, 28080 / 200, 0, 4);
-                    if (metarule(14, 0)) then begin
-                        display_msg(message_str(1536, 100));
+                    if (map_first_run) then begin
+                        display_msg(mstr(100));
                     end
                 end
             end
@@ -326,4 +326,3 @@ begin
         set_light_level(50);
     end
 end
-
