Mods/MutantsRising.demo/ELKOM4.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOM4.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOM4.ssl
index fe18539..ee092e8 100644
--- a/Mods/MutantsRising.demo/Original/ELKOM4.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOM4.ssl
@@ -145,30 +145,30 @@ end
 
 procedure map_exit_p_proc
 begin
-    if ((global_var(884) > 0) and ((global_var(904) > 0) or (global_var(907) > 0))) then begin
-        if (global_var(906) > game_time) then begin
-            set_global_var(905, global_var(906));
+    if ((global_var(GVAR_HEALING_MOD) > 0) and ((global_var(GVAR_BLEEDING_WOUNDS) > 0) or (global_var(GVAR_PAUSED_WOUNDS) > 0))) then begin
+        if (global_var(GVAR_BLEEDING_PILLS_TIME) > game_time) then begin
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, global_var(GVAR_BLEEDING_PILLS_TIME));
         end
         else begin
-            set_global_var(905, game_time);
+            set_global_var(GVAR_EXIT_BLEEDING_TIME, game_time);
         end
     end
 end
 
 procedure map_enter_p_proc
 begin
-    if (metarule(14, 0)) then begin
-        if (get_critter_stat(dude_obj, 4) > 3) then begin
-            display_msg(message_str(1735, 101));
+    if (map_first_run) then begin
+        if (dude_iq > 3) then begin
+            display_msg(mstr(101));
         end
         else begin
-            display_msg(message_str(1735, 100));
+            display_msg(mstr(100));
         end
     end
     override_map_start(24560 % 200, 24560 / 200, 0, 0);
-    if (get_critter_stat(dude_obj, 4) < 4) then begin
+    if (dude_iq < 4) then begin
         if (tile_contains_obj_pid(23755, 0, 16777701) == 0) then begin
-            create_object_sid(16777701, 23755, 0, 1304);
+            create_object_sid(16777701, 23755, 0, SCRIPT_ELKOC1);
         end
         pops := tile_contains_pid_obj(23755, 0, 16777701);
         add_timer_event(pops, 5, 0);
@@ -258,11 +258,10 @@ begin
     else begin
         if (map_var(3) == 0) then begin
             set_map_var(3, 1);
-            display_msg(message_str(1735, 102));
+            display_msg(mstr(102));
             give_exp_points(100);
-            display_msg(message_str(1735, 103));
+            display_msg(mstr(103));
         end
         set_light_level(50);
     end
 end
-
