Mods/MutantsRising.demo/ELKOS2.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOS2.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOS2.ssl
index d114927..da61d7f 100644
--- a/Mods/MutantsRising.demo/Original/ELKOS2.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOS2.ssl
@@ -194,10 +194,10 @@ begin
                 if (map_var(14) == 0) then begin
                     set_map_var(14, 1);
                     if (map_var(6) > 0) then begin
-                        gfade_out(1);
+                        fade_out;
                         set_map_var(6, 0);
                         move_to(dude_obj, map_var(10), 0);
-                        gfade_in(1);
+                        fade_in;
                     end
                 end
                 else begin
@@ -215,4 +215,3 @@ end
 procedure map_update_p_proc
 begin
 end
-
