Mods/MutantsRising.demo/ELKOS3.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/ELKOS3.ssl b/Mods/MutantsRising.demo/ReDefine/ELKOS3.ssl
index 9afdb76..30be82c 100644
--- a/Mods/MutantsRising.demo/Original/ELKOS3.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/ELKOS3.ssl
@@ -140,7 +140,7 @@ end
 
 procedure spatial_p_proc
 begin
-    if ((source_obj == dude_obj) and (global_var(701) == 3)) then begin
+    if ((source_obj == dude_obj) and (global_var(GVAR_ELKO_BIG_TROUBLE) == 3)) then begin
         reg_anim_func(2, dude_obj);
         move_to(dude_obj, tile_num_in_direction(tile_num(self_obj), 5, 1), elevation(self_obj));
         add_timer_event(cassidy_ptr, 8, 3);
@@ -154,4 +154,3 @@ end
 procedure map_update_p_proc
 begin
 end
-
