Mods/MutantsRising.demo/GLBLDWND.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/GLBLDWND.ssl b/Mods/MutantsRising.demo/ReDefine/GLBLDWND.ssl
index abf839a..1c527c1 100644
--- a/Mods/MutantsRising.demo/Original/GLBLDWND.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/GLBLDWND.ssl
@@ -39,28 +39,28 @@ begin
         LVar1 := get_sfall_arg;
         LVar2 := get_sfall_arg;
         LVar3 := get_sfall_arg;
-        if (global_var(884) > 0) then begin
+        if (global_var(GVAR_HEALING_MOD) > 0) then begin
             if (LVar2 == dude_obj) then begin
                 if (LVar3 != 6) then begin
                     if (LVar0 == 3) then begin
                         display_msg("You're bleeding heavily!");
-                        if (has_trait(2, dude_obj, 0) == 1) then begin
-                            if (global_var(917) < game_time) then begin
-                                set_global_var(917, game_time + (30 * (60 * 10)));
+                        if (has_trait(TRAIT_TRAIT, dude_obj, TRAIT_fast_metabolism) == 1) then begin
+                            if (global_var(GVAR_CHILD_OF_SUN_WOUND_HEAL_TIME) < game_time) then begin
+                                set_global_var(GVAR_CHILD_OF_SUN_WOUND_HEAL_TIME, game_time + (30 * (60 * 10)));
                             end
                         end
-                        set_global_var(904, global_var(904) + 1);
+                        set_global_var(GVAR_BLEEDING_WOUNDS, global_var(GVAR_BLEEDING_WOUNDS) + 1);
                     end
                 end
                 else begin
                     if (LVar0 >= 2) then begin
                         display_msg("You're bleeding heavily!");
-                        if (has_trait(2, dude_obj, 0) == 1) then begin
-                            if (global_var(917) < game_time) then begin
-                                set_global_var(917, game_time + (30 * (60 * 10)));
+                        if (has_trait(TRAIT_TRAIT, dude_obj, TRAIT_fast_metabolism) == 1) then begin
+                            if (global_var(GVAR_CHILD_OF_SUN_WOUND_HEAL_TIME) < game_time) then begin
+                                set_global_var(GVAR_CHILD_OF_SUN_WOUND_HEAL_TIME, game_time + (30 * (60 * 10)));
                             end
                         end
-                        set_global_var(904, global_var(904) + 1);
+                        set_global_var(GVAR_BLEEDING_WOUNDS, global_var(GVAR_BLEEDING_WOUNDS) + 1);
                     end
                 end
             end
@@ -172,4 +172,3 @@ begin
     end
     return 0;
 end
-
