Mods/MutantsRising.demo/GLVRAX.ssl.diff
diff --git a/Mods/MutantsRising.demo/Original/GLVRAX.ssl b/Mods/MutantsRising.demo/ReDefine/GLVRAX.ssl
index 5a740b9..237af55 100644
--- a/Mods/MutantsRising.demo/Original/GLVRAX.ssl
+++ b/Mods/MutantsRising.demo/ReDefine/GLVRAX.ssl
@@ -46,8 +46,8 @@ begin
         LVar5 := get_sfall_arg;
         LVar6 := get_sfall_arg;
         if (obj_pid(LVar0) == 16777713) then begin
-            if (LVar1 > get_critter_stat(LVar0, 35)) then begin
-                LVar1 := get_critter_stat(LVar0, 35) - 1;
+            if (LVar1 > get_critter_stat(LVar0, STAT_current_hp)) then begin
+                LVar1 := get_critter_stat(LVar0, STAT_current_hp) - 1;
                 LVar2 := LVar2 bwor 1;
                 display_msg("Vrax was knocked out.");
             end
@@ -162,4 +162,3 @@ begin
     end
     return 0;
 end
-
